<?php

namespace App\Admin\Controllers;

use App\Http\Controllers\Controller;
use App\Store;
use Encore\Admin\Auth\Database\Administrator;
use Encore\Admin\Controllers\ModelForm;
use Encore\Admin\Facades\Admin;
use Encore\Admin\Form;
use Encore\Admin\Grid;
use Encore\Admin\Layout\Content;

class StoreController extends Controller
{
    use ModelForm;

    /**
     * Index interface.
     *
     * @return Content
     */
    public function index()
    {
        return Admin::content(function (Content $content) {

            $content->header('Your Stores');
            $content->description('List Of Stores Being Managed By You');
            $content->body($this->grid());
        });
    }

    /**
     * Edit interface.
     *
     * @param $id
     * @return Content
     */
    public function edit($id)
    {
        if (
            Admin::user()->inRoles(['administrator', 'supervisor'])
            ||
            Store::all()->find($id)['owner_id'] == Admin::user()->id
        ) {
            return Admin::content(function (Content $content) use ($id) {

                $content->header(Store::all()->find($id)['title']);
                $content->body($this->form()->edit($id));
            });
        } else {
            return Admin::content(function (Content $content) use ($id) {
                $content->header('You Don`t Have The Permission');
            });
        }

    }

    /**
     * Create interface.
     *
     * @return Content
     */
    public function create()
    {
        return Admin::content(function (Content $content) {

            $content->header('Add Store');
            $content->description('description');
            $content->body($this->form());
        });
    }

    /**
     * Make a grid builder.
     *
     * @return Grid
     */
    protected function grid()
    {
        return Admin::grid(Store::class, function (Grid $grid) {

            if (!Admin::user()->inRoles(['administrator', 'supervisor'])) {
                $grid->model()->where('owner_id', Admin::user()->id);
            }
            $grid->id('ID')->sortable();
            $grid->column('title', 'Title');
            $grid->column('owner_id', 'Owner')->display(function ($owner_id) {
                $owner = Administrator::all()->where('id', $owner_id)->first();
                return $owner['name'] . "";
            });
            $grid->column('isVerified', 'Verified');
            $grid->created_at();
            $grid->updated_at();

            if (Admin::user()->cannot('store.delete')) {
                $grid->actions(function (Grid\Displayers\Actions $actions) {

                    $actions->disableDelete();

                });

                $grid->tools(function (Grid\Tools $tools) {
                    $tools->batch(function (Grid\Tools\BatchActions $actions) {
                        $actions->disableDelete();
                    });
                });
            }
            if (Admin::user()->cannot('store.edit')) {
                $grid->actions(function (Grid\Displayers\Actions $actions) {

                    $actions->disableEdit();

                });
            }

        });
    }

    /**
     * Make a form builder.
     *
     * @return Form
     */
    protected function form()
    {
        return Admin::form(Store::class, function (Form $form) {

            $form->display('id', 'ID');
            if (Admin::user()->inRoles(['administrator', 'supervisor'])) {
                $form->text('title', 'Title');
                $form->textarea('address', 'Address');
                $form->image('coverImage', 'Cover')->move('/images/stores/covers')->removable();
                $form->image('logo', 'logo')->move('/images/stores/logos')->removable();

                $form->number('lat', 'Latitude');
                $form->number('lng', 'Longitude');
            } else {
                $form->display('title', 'Title');
                $form->display('address', 'Address');
                $form->image('coverImage', 'Cover')->move('/images/stores/covers')->removable();
                $form->image('logo', 'logo')->move('/images/stores/logos')->removable();
                $form->display('lat', 'Latitude');
                $form->display('lng', 'Longitude');
            }
            $zones = array(
                52 => 'آجودانیه',
                58 => 'آصف',
                59 => 'آقا بزرگی',
                60 => 'اتوبان ارتش',
                61 => 'اراج',
                1 => 'ازگل',
                2 => 'اقدسیه',
                3 => 'الهیه',
                693 => 'امامزاده قاسم',
                62 => 'اندرزگو',
                53 => 'انستیتو پاستور',
                63 => 'اوشانی',
                4 => 'اوین',
                5 => 'باغ فردوس',
                6 => 'بام تهران',
                64 => 'باهنر (نیاوران)',
                65 => 'بلوار بسیج',
                66 => 'بلوار دانشجو',
                67 => 'بلوار شهرزاد',
                68 => 'بلوار کاوه',
                7 => 'بوکان',
                8 => 'پارک قیطریه',
                9 => 'پارک نیاوران',
                69 => 'پاسداران چهارراه تا نوبنیاد',
                10 => 'پاسداران نوبنیاد',
                70 => 'پسیان',
                71 => 'پور ابتهاج',
                11 => 'جماران',
                72 => 'جمال آباد',
                12 => 'جمشیدیه',
                73 => 'چناران',
                13 => 'چهارراه فرمانیه',
                14 => 'چیذر',
                74 => 'حکمت',
                75 => 'خزر',
                15 => 'خیابان شهرداری تجریش',
                16 => 'دارآباد',
                17 => 'دربند',
                18 => 'درکه',
                19 => 'دزاشیب',
                20 => 'دکتر حسابی',
                21 => 'روشنایی',
                22 => 'زعفرانیه',
                23 => 'سعدآباد',
                76 => 'سه راه اقدسیه',
                24 => 'سه راه یاسر',
                25 => 'سهیل',
                26 => 'سوهانک',
                27 => 'شریعتی الهیه',
                28 => 'شریعتی قیطریه',
                77 => 'شهرک البرز',
                78 => 'شهرک چمران',
                79 => 'شهرک صدف',
                80 => 'شهرک قائم',
                81 => 'شهرک گلها',
                29 => 'شهرک محلاتی',
                30 => 'شهرک نفت',
                82 => 'صاحبقرانیه',
                31 => 'فرشته',
                32 => 'فرمانیه شرقی',
                33 => 'فرمانیه غربی',
                83 => 'قلندری شمالی',
                34 => 'قیطریه',
                87 => 'گلابدره',
                88 => 'مجتمع مسکونی سبحان',
                40 => 'محمودیه',
                41 => 'مقدس اردبیلی',
                89 => 'مقصود بیک',
                90 => 'منظریه',
                91 => 'میدان اراج',
                54 => 'میدان الف',
                42 => 'میدان تجریش',
                55 => 'میدان دارآباد',
                43 => 'میدان قدس',
                57 => 'میدان گلها فاطمی',
                56 => 'میدان ندا',
                44 => 'میدان نوبنیاد',
                45 => 'میدان نیاوران',
                46 => 'مینی سیتی',
                47 => 'نیاوران',
                48 => 'نیاوران قدس',
                49 => 'ولنجک',
                50 => 'ولیعصر فرشته',
                51 => 'ولیعصر محمودیه',
                35 => 'کاخ سعدآباد',
                36 => 'کاخ نیاوران',
                37 => 'کاشانک',
                38 => 'کامرانیه جنوبی',
                39 => 'کامرانیه شمالی',
                84 => 'کوهسار ولنجک',
                85 => 'کوی دانشگاه',
                86 => 'کوی لاله',
                145 => 'آتی ساز',
                146 => 'آزادی - توحید',
                150 => 'اکبری (مستوفی)',
                151 => 'ایثار',
                92 => 'ایران زمین',
                93 => 'ایوانک',
                94 => 'باقرخان',
                95 => 'برج میلاد',
                96 => 'برق آلستوم',
                152 => 'بلوار آریافر',
                153 => 'بلوار درختی',
                97 => 'بلوار دریا',
                154 => 'بلوار دلاوران',
                155 => 'بلوار شهرداری جنوبی',
                156 => 'بلوار شهرداری شمالی',
                157 => 'بلوار صالحی',
                98 => 'بلوار فرهنگ سعادت آباد',
                100 => 'بلوار مدیریت',
                158 => 'بلوار کوهسار',
                99 => 'بلوار کوهستان',
                159 => 'بهبودی',
                160 => 'بیست و چهار متری (سعادت آباد)',
                101 => 'پاتریس لومومبا',
                102 => 'پارک گفتگو',
                103 => 'پاکنژاد بالاتر از دریا',
                104 => 'پاکنژاد پایین تر از دریا',
                105 => 'پل مدیریت',
                106 => 'پل نصر (گیشا)',
                107 => 'تهران نو',
                108 => 'تهران ویلا',
                161 => 'تیموری',
                109 => 'جلال آل احمد',
                110 => 'چهارراه سرو',
                162 => 'چهارراه مسجد',
                163 => 'چوب تراش',
                111 => 'حبیب الله',
                112 => 'خوردین',
                113 => 'خیابان خسرو',
                114 => 'دادمان',
                115 => 'دانشگاه شریف',
                164 => 'زرافشان',
                116 => 'ستارخان از اشرفی تا شیخ فضل الله',
                117 => 'ستارخان از شیخ فضل الله تا پاتریس',
                118 => 'ستارخان توحید',
                143 => 'ستارخان نیایش',
                119 => 'سرو شرقی',
                120 => 'سرو غربی',
                685 => 'سعادت آباد',
                121 => 'سعادت آباد بالاتر از میدان کاج',
                122 => 'سعادت آباد پایین تر از میدان کاج',
                123 => 'شادمهر',
                124 => 'شهرآرا',
                687 => 'شهرک آزمایش',
                165 => 'شهرک بوعلی',
                125 => 'شهرک ژاندارمری',
                126 => 'شهرک غرب',
                127 => 'شهرک مخابرات',
                166 => 'شهرک هما',
                128 => 'طرشت',
                167 => 'علامه طباطبایی جنوبی',
                168 => 'علامه طباطبایی شمالی',
                129 => 'فرحزادی بالاتر از دادمان',
                130 => 'فرحزادی پایین تر دادمان',
                131 => 'فلامک جنوبی',
                132 => 'فلامک شمالی',
                133 => 'فلکه اول صادقیه',
                134 => 'فلکه دوم صادقیه',
                170 => 'گل افشان (شهرک غرب)',
                135 => 'گیشا (نصر)',
                171 => 'مجتمع مسکونی سروستان',
                136 => 'مرزداران',
                172 => 'میدان بهرود',
                137 => 'میدان توحید',
                147 => 'میدان تیموری',
                138 => 'میدان صنعت (شهرک غرب)',
                139 => 'میدان فرهنگ (سعادت آباد)',
                140 => 'میدان کاج',
                141 => 'میدان کتاب',
                142 => 'نصرت غربی',
                149 => 'هتل اوین',
                173 => 'هرمزان',
                144 => 'ویلا (نجات الهی)',
                169 => 'کوی فراز',
                239 => 'آرارات',
                240 => 'آرش شرقی',
                241 => 'آرش غربی',
                174 => 'آفریقا از ظفر تا میرداماد (جردن)',
                175 => 'آفریقا بالاتر از ظفر (جردن)',
                176 => 'آفریقا پایین تر از میرداماد (جردن)',
                243 => 'احتشامیه',
                177 => 'اختیاریه جنوبی',
                178 => 'اختیاریه شمالی',
                235 => 'ارسباران',
                244 => 'اسفندیار',
                245 => 'اسکان',
                179 => 'برزیل',
                247 => 'بهروز',
                180 => 'پارک آب و آتش',
                181 => 'پارک طالقانی',
                182 => 'پارک ملت',
                183 => 'پارک وی',
                184 => 'پاسداران بوستان',
                185 => 'پاسداران ضرابخانه',
                186 => 'پاسداران گلستان',
                187 => 'پاسداران نگارستان',
                188 => 'پل رومی',
                248 => 'جلفا',
                189 => 'چهارراه پاسداران',
                249 => 'چهارراه جهان کودک',
                250 => 'چهارراه قنات',
                251 => 'چهارراه کاوه',
                190 => 'حسینیه ارشاد',
                252 => 'خدامی',
                242 => 'خیابان آفتاب',
                246 => 'خیابان امیرنیا',
                715 => 'خیابان عطار',
                191 => 'خیابان ونک',
                253 => 'درب دوم',
                192 => 'دروس',
                193 => 'ده ونک',
                194 => 'دو راهی قلهک',
                195 => 'دولت(کلاهدوز)',
                196 => 'دیباجی جنوبی',
                197 => 'دیباجی شمالی',
                198 => 'زرگنده (خاقانی)',
                199 => 'سئول',
                200 => 'سئول چمران',
                201 => 'سئول نیایش',
                202 => 'سه راه ضرابخانه',
                421 => 'سه راه نشاط',
                203 => 'سیدخندان',
                204 => 'شریعتی دولت',
                205 => 'شریعتی سهیل',
                206 => 'شریعتی صدر',
                207 => 'شریعتی ظفر',
                208 => 'شریعتی میرداماد',
                209 => 'شریعتی همت',
                422 => 'شمس تبریزی',
                423 => 'شهرک سئول',
                424 => 'شهرک فجر',
                425 => 'شهرک نور',
                210 => 'شیخ بهایی جنوبی',
                211 => 'شیخ بهایی شمالی',
                212 => 'شیراز جنوبی',
                213 => 'شیراز شمالی',
                214 => 'ظفر(دستگردی)',
                215 => 'فرید افشار',
                426 => 'قبا',
                427 => 'قلندری جنوبی',
                216 => 'قلهک',
                217 => 'گاندی شمالی',
                428 => 'گل نبی',
                429 => 'مجموعه ورزشی انقلاب',
                218 => 'ملاصدرا',
                430 => 'میدان احتشامیه',
                219 => 'میدان اختیاریه',
                236 => 'میدان جوانان',
                220 => 'میدان شیخ بهایی',
                222 => 'میدان مادر (محسنی)',
                237 => 'میدان مینا',
                238 => 'میدان هدایت',
                223 => 'میدان ونک',
                221 => 'میدان کتابی(احمد روشن)',
                224 => 'میرداماد',
                225 => 'میرداماد از شریعتی تا مدرس',
                226 => 'میرداماد از مدرس تا ولیعصر',
                227 => 'نفت شمالی',
                228 => 'نمایشگاه تهران',
                431 => 'هدایت',
                714 => 'والی نژاد',
                229 => 'ولیعصر جام جم',
                230 => 'ولیعصر ظفر',
                231 => 'ولیعصر میرداماد',
                232 => 'ولیعصر نیایش',
                233 => 'ونک سئول',
                234 => 'یخچال',
                454 => 'آیت بالاتر از رسالت',
                455 => 'اردیبهشت جنوبی',
                456 => 'اردیبهشت شمالی',
                457 => 'استخر',
                432 => 'باغ لویزان',
                463 => 'برادران پناهی نیا',
                458 => 'بلوار استقلال',
                433 => 'بلوار پروین',
                459 => 'بلوار جشنواره',
                460 => 'بلوار شاهد',
                700 => 'بنی هاشم',
                461 => 'پارک جنگلی شهید فلاحی',
                434 => 'پارک جنگلی لویزان',
                462 => 'پایدارفرد',
                435 => 'تهران پارس',
                436 => 'چهارراه سراج',
                437 => 'حکیمیه',
                438 => 'خواجه عبدالله انصاری',
                464 => 'خیابان الغدیر',
                439 => 'ساقدوش (افشاری)',
                440 => 'سراج',
                465 => 'شعبانلو',
                466 => 'شهرک امید',
                467 => 'شهید عراقی',
                441 => 'شیان',
                442 => 'فرجام',
                468 => 'فرخی یزدی',
                443 => 'لویزان',
                469 => 'مجدیه شمالی',
                444 => 'مجیدیه شمالی',
                470 => 'مریم',
                471 => 'مژده',
                473 => 'ملت',
                445 => 'مهران',
                472 => 'مکران',
                474 => 'میدان اشراق',
                449 => 'میدان پروین',
                450 => 'میدان تختی',
                451 => 'میدان رسالت',
                446 => 'میدان قنات کوثر',
                452 => 'میدان ملت',
                447 => 'میدان هروی',
                453 => 'هتل شیان',
                448 => 'هنگام',
                475 => 'وفامنش',
                507 => 'آبشناسان',
                476 => 'آیت الله کاشانی',
                510 => 'ابوذر - اشرفی اصفهانی',
                708 => 'اشرفی اصفهانی بالاتر از نیایش',
                477 => 'اشرفی اصفهانی تیراژه',
                479 => 'باغ فیض',
                511 => 'بزرگراه جناح',
                512 => 'بلوار باهنر ستاری',
                513 => 'بلوار عدل',
                480 => 'بلوار فردوس شرقی',
                481 => 'بلوار فردوس غربی',
                689 => 'پونک شمالی',
                482 => 'پیامبر شرقی',
                483 => 'پیامبر غربی',
                484 => 'پیامبر مرکزی',
                485 => 'جنت آباد جنوبی',
                486 => 'جنت آباد شمالی',
                487 => 'جنت آباد مرکزی',
                514 => 'چهار دیواری',
                515 => 'حصارک',
                709 => 'زیتون',
                707 => 'زیتون',
                508 => 'سازمان آب',
                488 => 'سازمان آب آیت الله کاشانی',
                489 => 'سازمان برنامه',
                490 => 'ستاری حکیم',
                491 => 'سردار جنگل',
                492 => 'سیمون بلیوار',
                493 => 'شاهین جنوبی',
                494 => 'شاهین شمالی',
                495 => 'شهر زیبا',
                496 => 'شهران',
                497 => 'شهرک آپادانا',
                706 => 'شهرک شرکت نفت (OPG)',
                498 => 'شهرک نفت سیمون بلیوار',
                499 => 'شهرک والفجر',
                694 => 'فاز دو اکباتان',
                500 => 'فاز یک اکباتان',
                501 => 'فلکه اول شهران',
                502 => 'فلکه دوم شهران',
                516 => 'گلفام',
                517 => 'مجتمع تجاری کورش',
                518 => 'مراد آباد',
                506 => 'میدان پونک',
                509 => 'میدان دانشگاه علوم تحقیقات',
                503 => 'کن',
                504 => 'کوی ارم',
                505 => 'کوی بیمه',
                565 => 'آ اس پ',
                566 => 'آبان جنوبی (شهید عضدی)',
                567 => 'آبان شمالی (شهید عضدی)',
                519 => 'آفریقا همت تا آرژانتین (جردن)',
                568 => 'الوند',
                705 => 'امیرآباد جنوبی',
                520 => 'امیرآباد شمالی',
                521 => 'ایرانشهر',
                569 => 'بخارست (احمد قصیر)',
                570 => 'برادران مظفر',
                571 => 'برج تهران',
                572 => 'بزرگراه مدرس',
                573 => 'بزرگمهر',
                522 => 'بلوار کشاورز',
                524 => 'بلوار کشاورز فلسطین',
                525 => 'بلوار کشاورز کارگر',
                574 => 'بیستون',
                527 => 'بیمارستان امام خمینی',
                528 => 'بیهقی',
                529 => 'پارک ساعی',
                530 => 'پارک شفق',
                531 => 'پارک لاله',
                532 => 'پارک هنرمندان',
                575 => 'پروین اعتصامی فاطمی',
                576 => 'توانیر',
                533 => 'جمال زاده',
                577 => 'جهان آرا',
                578 => 'چهارراه کالج',
                579 => 'حجاب',
                523 => 'حجاب - بلوار کشاورز',
                667 => 'خالد اسلامبولی',
                580 => 'خردمند جنوبی',
                581 => 'خردمند شمالی',
                534 => 'دکتر قریب',
                582 => 'زرتشت',
                535 => 'سپهبد قرنی',
                583 => 'سمیه',
                584 => 'سنایی',
                536 => 'شانزده آذر',
                585 => 'طالقانی',
                586 => 'طالقانی قرنی',
                540 => 'فاطمی (جهاد)',
                537 => 'فاطمی حجاب',
                538 => 'فاطمی کاج',
                539 => 'فاطمی کارگر',
                541 => 'فتحی شقاقی',
                587 => 'فجر(جم)',
                588 => 'فرصت شیرازی',
                542 => 'فلسطین شمالی',
                543 => 'قائم مقام فراهانی',
                589 => 'قدس',
                544 => 'قزل قلعه',
                547 => 'گاندی جنوبی',
                594 => 'گمنام',
                590 => 'لارستان',
                591 => 'مدبر (مهرام)',
                548 => 'میدان آرژانتین',
                562 => 'میدان انقلاب',
                563 => 'میدان سلماس',
                549 => 'میدان فاطمی',
                564 => 'میدان فرهنگ (میدان اسد آبادی)',
                550 => 'میدان فلسطین',
                551 => 'میدان ولیعصر',
                552 => 'نصرت',
                592 => 'وصال شیرازی',
                553 => 'ولیعصر آبشار',
                554 => 'ولیعصر بهشتی',
                555 => 'ولیعصر پل همت',
                556 => 'ولیعصر توانیر',
                557 => 'ولیعصر زرتشت',
                558 => 'ولیعصر طالقانی',
                559 => 'ولیعصر فاطمی',
                593 => 'ونک پارک',
                545 => 'کارگر شمالی تا گمنام',
                526 => 'کبیر زاده (بلوار لاله)',
                546 => 'کریمخان',
                560 => 'یوسف آباد بالاتر از میدان اسدآبادی',
                561 => 'یوسف آباد پایین تراز میدان اسدآبادی',
                653 => 'ابن یمین',
                595 => 'اجاره دار (خواجه نطام)',
                654 => 'ادیبی',
                596 => 'امجدیه (خاقانی)',
                478 => 'اندیشه',
                597 => 'باغ موزه قصر',
                669 => 'بسطامی',
                598 => 'بهار جنوبی',
                599 => 'بهار شمالی',
                600 => 'بهارشیراز',
                601 => 'بهشتی مدرس (عباس آباد)',
                704 => 'پروشات',
                602 => 'پل چوبی',
                603 => 'پلیس',
                604 => 'پیچ شمیران',
                605 => 'ترکمنستان',
                606 => 'چهارراه سهروردی',
                607 => 'چهارراه عباس آباد',
                608 => 'چهارراه قصر',
                609 => 'چهارراه نظام آباد',
                656 => 'حشمتیه',
                645 => 'خرمشهر',
                610 => 'خواجه نصیر طوسی',
                657 => 'خواجه نظام',
                655 => 'خیابان پاکستان',
                611 => 'دبستان (کابلی)',
                612 => 'دماوند از سبلان تا امام حسین',
                613 => 'سبلان جنوبی',
                614 => 'سبلان شمالی',
                615 => 'سپاه',
                616 => 'سرباز',
                617 => 'سلیمان خاطر',
                658 => 'سه راه زندان',
                659 => 'سه راه طالقانی',
                618 => 'سهروردی جنوبی',
                619 => 'سهروردی شمالی',
                620 => 'سورنا (حسینی)',
                621 => 'شریعتی بهارشیراز',
                622 => 'شریعتی پلیس',
                623 => 'شریعتی سمیه',
                624 => 'شریعتی مطهری',
                625 => 'شریعتی معلم',
                626 => 'شریعتی ملک',
                627 => 'شهید قدوسی',
                646 => 'شهید قندی',
                628 => 'صابونچی (مهناز)',
                660 => 'طالقانی بهار',
                661 => 'عشقیار (نیلوفر)',
                629 => 'قنبرزاده',
                664 => 'گرگان',
                665 => 'مدنی از امام علی تا امام حسین',
                666 => 'مرودشت',
                631 => 'مطهری (تخت طاووس)',
                630 => 'مطهری مفتح',
                632 => 'معلم',
                633 => 'مفتح جنوبی',
                634 => 'مفتح شمالی',
                635 => 'ملک',
                647 => 'میدان امام حسین',
                648 => 'میدان بهار شیراز',
                649 => 'میدان پالیزی',
                650 => 'میدان سبلان',
                651 => 'میدان سپاه',
                636 => 'میدان نامجو (گرگان)',
                652 => 'میدان نیلوفر',
                637 => 'میدان هفت تیر',
                638 => 'میرزای شیرازی',
                639 => 'میرعماد',
                640 => 'نامجو (گرگان)',
                641 => 'نظام آباد',
                642 => 'هویزه شرقی',
                643 => 'هویزه غربی',
                644 => 'ولیعصر مطهری',
                662 => 'کشواد',
                663 => 'کلیم کاشانی',
                668 => 'یوسفیان',
                266 => 'آیت پایین تر از رسالت',
                267 => 'اثنی عشری (شانزده متری دوم)',
                268 => 'امیری طائمه',
                269 => 'چهارراه تلفنخانه',
                270 => 'چهارراه تیرانداز',
                271 => 'چهارراه سیدالشهدا',
                272 => 'چهارراه کرمان',
                273 => 'خیابان ثانی',
                255 => 'دردشت',
                672 => 'دماوند باقری تا رسالت',
                673 => 'دماوند باقری تا سبلان',
                274 => 'سمنگان',
                256 => 'فدک',
                257 => 'فلکه اول تهرانپارس',
                258 => 'فلکه چهارم تهرانپارس',
                259 => 'فلکه دوم تهرانپارس',
                260 => 'فلکه سوم تهرانپارس',
                275 => 'گلبرگ شرقی (جانبازان)',
                276 => 'گلبرگ غربی (جانبازان)',
                277 => 'گلشن دوست',
                670 => 'مجیدیه جنوبی',
                262 => 'مدائن',
                278 => 'مدنی از امام علی تا سبلان',
                279 => 'مدنی فدک',
                280 => 'مدنی گلبرگ',
                281 => 'مسیل باختر',
                263 => 'میدان شقایق',
                254 => 'میدان نبوت (هفت حوض)',
                264 => 'میدان هلال احمر',
                671 => 'نارمک',
                265 => 'هفت حوض',
                282 => 'همایی(شانزده متری اول)',
                261 => 'کرمان',
                285 => 'آزادی',
                286 => 'استاد معین',
                283 => 'امام خمینی از یادگار تا جیهون',
                291 => 'بیست و یک متری جی',
                284 => 'دامپزشکی از سعیدی تا یادگار',
                287 => 'فرودگاه',
                288 => 'مهرآباد جنوبی',
                289 => 'میدان آزادی',
                290 => 'هاشمی از سعیدی تا یادگار',
                299 => 'آذربایجان از آزادی تا توحید',
                292 => 'امام خمینی از جیهون تا قصرالدشت',
                697 => 'بریانک',
                300 => 'جی',
                301 => 'جیحون',
                293 => 'خوش جنوبی',
                294 => 'خوش شمالی',
                295 => 'رودکی جنوبی بالاتر از آذربایجان',
                302 => 'زنجان جنوبی',
                305 => 'شهیدان',
                306 => 'طوس',
                296 => 'قصرالدشت',
                303 => 'میدان جمهوری',
                298 => 'نواب صفوی',
                304 => 'هاشمی از یادگار تا نواب',
                297 => 'کارون',
                330 => 'آذربایجان از کارگر تا ولیعصر',
                331 => 'اسکندری',
                308 => 'امام خمینی از حر تا ولیعصر',
                309 => 'امام خمینی از ولیعصر تا حسن آباد',
                675 => 'امیر بهادر',
                332 => 'انقلاب',
                310 => 'پارک دانشجو',
                307 => 'جمال زاده (حشمت الدوله)',
                312 => 'جمهوری از میدان تا کارگر',
                313 => 'جمهوری از ولیعصر تا حافظ',
                311 => 'جمهوری از کارگر تا ولیعصر',
                686 => 'جمهوری-کارگر تا اسکندری',
                333 => 'چهارراه لشگر',
                314 => 'چهارراه ولیعصر',
                315 => 'حافظ شمالی',
                316 => 'حافظ طالقانی',
                317 => 'حافظ نوفل لوشاتو',
                338 => 'خابان وحدت اسلامی (حسن آباد)',
                688 => 'خیابان آذربایجان-کارگر تا اسکندری',
                318 => 'دوازده فروردین',
                319 => 'رازی',
                339 => 'شهدای ژاندارمری',
                334 => 'شیخ هادی',
                320 => 'قزوین ولیعصر',
                340 => 'مصطفی خمینی',
                341 => 'مولوی از محمدیه تا چهارراه مولوی',
                335 => 'میدان پاستور',
                336 => 'میدان حر',
                337 => 'میدان حسن آباد',
                323 => 'میدان قزوین',
                324 => 'میدان منیریه',
                325 => 'نوفل لوشاتو حافظ تا ولیعصر',
                342 => 'هلال احمر',
                326 => 'ولیعصر آذربایجان',
                327 => 'ولیعصر امام خمینی',
                328 => 'ولیعصر جمهوری',
                329 => 'ولیعصر منیریه',
                321 => 'کارگر جنوبی از انقلاب تا میدان پاستور',
                322 => 'کارگر جنوبی از حر تا قزوین',
                365 => 'ابن سینا',
                366 => 'ابن سینا بهارستان',
                367 => 'امام زاده یحیی',
                368 => 'امیرکبیر',
                369 => 'ایران',
                701 => 'بازار بزرگ تهران',
                370 => 'بلوار قیام',
                371 => 'پامنار',
                372 => 'پانزده خرداد',
                343 => 'جمهوری از فردوسی تا حافظ',
                344 => 'جمهوری بهارستان',
                345 => 'جمهوری فردوسی',
                346 => 'چهارراه اسلامبول',
                347 => 'حافظ بعد از پل کالج',
                373 => 'خراسان',
                374 => 'خیابان ری',
                348 => 'دروازه دولت',
                349 => 'دروازه شمیران',
                375 => 'زرین نعل',
                350 => 'سعدی',
                351 => 'سی تیر',
                376 => 'شوش از میدان شوش تا هفده شهریور',
                377 => 'شیخ صفی',
                378 => 'صفی علیشاه',
                352 => 'فردوسی',
                353 => 'فلسطین جنوبی از انقلاب تا جمهوری',
                354 => 'فلسطین جنوبی پایین تر از جمهوری',
                380 => 'گوته',
                381 => 'مازندران',
                382 => 'مردم',
                383 => 'منوچهری',
                703 => 'مولوی',
                702 => 'مولوی (میدان مولوی تا خیابان مصطفی خمینی)',
                358 => 'میدان امام خمینی (توپ خانه)',
                359 => 'میدان بهارستان',
                360 => 'میدان خراسان',
                361 => 'میدان شهداء (هفده شهریور)',
                362 => 'میدان شوش',
                355 => 'میدان فردوسی',
                356 => 'میدان قیام',
                357 => 'نوفل لوشاتو فردوسی تا حافظ',
                363 => 'هفده شهریور جنوب میدان شهداء',
                364 => 'هفده شهریور شمال میدان شهداء',
                384 => 'وحدت اسلامی',
                379 => 'کوچه مروی',
                388 => 'امامت',
                385 => 'پیروزی',
                389 => 'مسیل جاجرود',
                390 => 'مسیل منوچهری',
                386 => 'میدان چایچی',
                387 => 'نیرو هوایی',
                392 => 'بلوار ابوذر',
                393 => 'چهارصد دستگاه',
                391 => 'خاوران',
                695 => 'سر آسیاب',
                394 => 'مجاهدین اسلام',
                395 => 'کیانشهر',
                398 => 'جوادیه',
                399 => 'علی آباد',
                397 => 'میدان کلانتری',
                396 => 'نازی آباد',
                400 => 'ابوذر - فلاح',
                401 => 'سه راه آذری',
                403 => 'آشتیانی (جواد الائمه)',
                402 => 'میدان الغدیر',
                404 => 'بهمنیار',
                405 => 'خانی آباد',
                406 => 'شکوفه',
                414 => 'بلوار دیلمان',
                415 => 'پروین اعتصامی دولت آباد',
                409 => 'جوانمرد قصاب',
                407 => 'دولت آباد',
                408 => 'دیلمان',
                416 => 'سه راه ورامین',
                417 => 'شهرک شهید مفتح',
                418 => 'شهید غیوری',
                410 => 'میدان شهرداری (قیصر امین پور)',
                411 => 'میدان شهرری',
                412 => 'میدان نماز',
                413 => 'میدان هادی ساعی',
                419 => 'بلوار گلها',
                674 => 'تهرانسر',
                420 => 'شهرک دانشگاه',
                717 => 'شهرک شهید غزالی',
                718 => 'بلوار کوهک',
                710 => 'دریاچه چیتگر',
                712 => 'شهرک چیتگر',
                716 => 'شهرک شهید باقری',
                711 => 'شهرک شهید صیاد شیرازی',
                713 => 'میدان دریاچه',
            );

            $form->select('zone_id', 'Zone')->options($zones);
            $form->radio('saturday', 'saturday')->options([
                false => 'closed',
                true => 'open'
            ]);
            $form->radio('sunday', 'sunday')->options([
                false => 'closed',
                true => 'open'
            ]);;
            $form->radio('monday', 'monday')->options([
                false => 'closed',
                true => 'open'
            ]);;
            $form->radio('tuesday', 'tuesday')->options([
                false => 'closed',
                true => 'open'
            ]);;
            $form->radio('wednesday', 'wednesday')->options([
                false => 'closed',
                true => 'open'
            ]);;
            $form->radio('thursday', 'thursday')->options([
                false => 'closed',
                true => 'open'
            ]);;
            $form->radio('friday', 'friday')->options([
                false => 'closed',
                true => 'open'
            ]);;
            $form->select('openingHour', 'Opening Hour')->options(
                [
                    0 => '00',
                    1 => '01',
                    2 => '02',
                    3 => '03',
                    4 => '04',
                    5 => '05',
                    6 => '06',
                    7 => '07',
                    8 => '08',
                    9 => '09',
                    10 => '10',
                    11 => '11',
                    12 => '12',
                    13 => '13',
                    14 => '14',
                    15 => '15',
                    16 => '16',
                    17 => '17',
                    18 => '18',
                    19 => '19',
                    20 => '20',
                    21 => '21',
                    22 => '22',
                    23 => '23'

                ]
            );
            $form->select('closingHour', 'Closing Hour')->options(
                [
                    0 => '00',
                    1 => '01',
                    2 => '02',
                    3 => '03',
                    4 => '04',
                    5 => '05',
                    6 => '06',
                    7 => '07',
                    8 => '08',
                    9 => '09',
                    10 => '10',
                    11 => '11',
                    12 => '12',
                    13 => '13',
                    14 => '14',
                    15 => '15',
                    16 => '16',
                    17 => '17',
                    18 => '18',
                    19 => '19',
                    20 => '20',
                    21 => '21',
                    22 => '22',
                    23 => '23'

                ]
            );
            $form->display('created_at', 'Created At');
            $form->display('updated_at', 'Updated At');
//            $form->saving(function (Form $form){
//                if($form->openingHour < $form->closingHour){
//                    throw new \Exception('Opening Hour And Closing Hour Does Not Match');
//                }
//            });

            //should be changed to Sellers Or all

            if (Admin::user()->inRoles(['administrator', 'supervisor'])) {
                $users = Administrator::all()->pluck('name', 'id');
                $form->select('owner_id', 'Owner')->options($users);
                $form->radio('isVerified', 'Status')->options([
                    true => 'Verified',
                    false => 'Not Verified'
                ]);
            } else {
                $model = Store::all()->find(request()->route()->parameter('store'));

                if ($model && $model->isVerified) {
                    $form->html('<p style="color: greenyellow;">Your Store Have Been Verified By Supervisors</p>');
                } else if ($model && !$model->isVerified) {
                    $form->html('<p style="color: red;">Your Store Have Not Been Verified Yet By Supervisors!</p>');
                } else {
                    $form->html('<p style="color: blue;">Your New Store Should Be Verified By Supervisors!</p>');
                }
            }

        });
    }
}
